# Module 2

## 1.Libraries

In [1]:
# SQL
from sqlalchemy import create_engine
import pymysql

# DS Bsics
import numpy as np
import pandas as pd
from pandas_profiling import ProfileReport
import matplotlib.pyplot as plt
import seaborn as sns

## 2.Download Data

eliminar los # para ejecutar la celda.

In [2]:
#db_connection_str = 'mysql+pymysql://deepanalytics:Sqltask1234!@34.73.222.197/deepanalytics'
#db_connection = create_engine(db_connection_str)
#df = pd.read_sql('SELECT * FROM credit', con=db_connection)
### write to csv
#df.to_csv('dataset_M2_Original.csv', index=False) #index=False
#df.head()

## 3.EDA

### 3.1 Data Pre-processing

#### 3.1.1 removing some annoying rows

In [3]:
# import data
df = pd.read_csv('dataset_M2_Original.csv')
df.head()

,MyUnknownColumn,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default

Nice, let's take a look to the categorical variables.

In [4]:
df[['X2', 'X3', 'X4']].describe()

            X2          X3     X4
count    30204       30204  30204
unique       4           6      6
top     female  university      2
freq     18217       14107  16088

There is something strange in this DF. 4 values un the column X2 (SEX). Let's print the unique values it has:

In [5]:
df.X2.unique()

array(['SEX', 'female', 'male', 'X2'], dtype=object)

the words 'SEX' and 'X2' shouldn't be there.. Let's see whichs rows contains tose words, to perform that we can use .loc

In [6]:
df.loc[df['X2']=='SEX']

,MyUnknownColumn,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
203,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month

well.. rows 0 and 203 contains strange things, that are, basically, no usefull data. 
We have to remove them, and we can do that in different ways.

In [7]:
# in this case we're performing a copy of rows that NOT contain the word 'X2'
df = df[df.X2 != 'X2']
# and let's take a look to the output
df.X2.unique()

array(['SEX', 'female', 'male'], dtype=object)

worked nice, repeat with 'SEX'

In [8]:
df = df[df.X2 != 'SEX']
df.X2.unique()

array(['female', 'male'], dtype=object)

Nice now, at least X2, seems clean. let's repeat with X3 and X4

In [9]:
print(df.X3.unique())
print(df.X4.unique())

['university' 'graduate school' 'high school' 'other']
['1' '2' '3' '0']

There are no strange values and now the description and amount of values matches the documentation.

In [10]:
df[['X2', 'X3', 'X4']].describe()

            X2          X3     X4
count    30201       30201  30201
unique       2           4      4
top     female  university      2
freq     18217       14107  16088

#### 3.1.2 Rename columns

Just to make the DF readable, change the titles of the columns

In [11]:
df.rename(columns = {'MyUnknownColumn':'ID',
                     'X1':'LIMIT_BAL',
                     'X2':'SEX',
                     'X3':'EDU',
                     'X4':'MAR',
                     'X5':'AGE',
                     'X6':'PAY_0',
                     'X7':'PAY_2',
                     'X8':'PAY_3',
                     'X9':'PAY_4',
                     'X10':'PAY_5',
                     'X11':'PAY_6',
                     'X12':'BILL_AMT1',
                     'X13':'BILL_AMT2',
                     'X14':'BILL_AMT3',
                     'X15':'BILL_AMT4',
                     'X16':'BILL_AMT5',
                     'X17':'BILL_AMT6',
                     'X18':'PAY_AMT1',
                     'X19':'PAY_AMT2',
                     'X20':'PAY_AMT3',
                     'X21':'PAY_AMT4',
                     'X22':'PAY_AMT5' ,
                     'X23':'PAY_AMT6',
                     
                              }, inplace = True)

In [12]:
df.sample(4)

,ID,LIMIT_BAL,SEX,EDU,MAR,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,Y
6005,5802,240000,female,graduate school,2,29,-1,0,0,0,...,15296,24332,23896,10023,10000,5000,15000,15000,5000,not default
10956,10753,470000,male,university,1,32,0,0,0,0,...,148871,152309,155769,7000,6000,6000,6000,6000,8000,not default
9206,9003,30000,male,university,1,36,0,0,2,0,...,21655,22646,23764,1800,1500,1500,1500,1500,1500,default
14561,14358,50000,female,university,2,34,-2,-1,-1,0,...,13789,725,0,13573,13876,276,725,0,0,not default

#### 3.1.3 DTypes Analysis

If we run a df.dtypes we will get all columns as "object". This happens when mixed dtypes or just strings. So let's analyze each column and change it's type to a better one.

##### 3.1.3 Verification of dtypes

In [13]:
df.dtypes

ID           object
LIMIT_BAL    object
SEX          object
EDU          object
MAR          object
AGE          object
PAY_0        object
PAY_2        object
PAY_3        object
PAY_4        object
PAY_5        object
PAY_6        object
BILL_AMT1    object
BILL_AMT2    object
BILL_AMT3    object
BILL_AMT4    object
BILL_AMT5    object
BILL_AMT6    object
PAY_AMT1     object
PAY_AMT2     object
PAY_AMT3     object
PAY_AMT4     object
PAY_AMT5     object
PAY_AMT6     object
Y            object
dtype: object

In [14]:
ages = list(df.AGE)
type(ages[0])

str

Definitely AGE are stored as strings.

##### 3.1.3 change Dtypes

In [15]:
df.sample(4)

,ID,LIMIT_BAL,SEX,EDU,MAR,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,Y
6840,6637,80000,female,high school,1,41,2,2,2,2,...,61129,62348,61193,0,5000,2400,2341,0,2439,default
30019,29816,210000,male,graduate school,2,35,-1,-1,-1,-1,...,326,326,326,326,326,326,326,326,326,not default
12080,11877,180000,female,university,2,36,1,-2,-2,-2,...,0,1482,0,0,0,0,1482,0,9262,not default
12294,12091,50000,male,university,2,30,1,2,0,0,...,48371,56294,61259,0,2500,2271,50000,10100,3000,not default

Let use a dictionary to convert types of each column

In [16]:
convert_dict = {'ID':int,
                'LIMIT_BAL':float,
                'SEX':str,
                'EDU':str,
                'MAR':int,
                'AGE':int,
                'PAY_0':float,
                'PAY_2':float,
                'PAY_3':float,
                'PAY_4':float,
                'PAY_5':float,
                'PAY_6':float,
                'BILL_AMT1':float,
                'BILL_AMT2':float,
                'BILL_AMT3':float,
                'BILL_AMT4':float,
                'BILL_AMT5':float,
                'BILL_AMT6':float,
                'PAY_AMT1':float,
                'PAY_AMT2':float,
                'PAY_AMT3':float,
                'PAY_AMT4':float,
                'PAY_AMT5' :float,
                'PAY_AMT6':float,
                'Y':str
                }
df = df.astype(convert_dict)
df.dtypes

ID             int64
LIMIT_BAL    float64
SEX           object
EDU           object
MAR            int64
AGE            int64
PAY_0        float64
PAY_2        float64
PAY_3        float64
PAY_4        float64
PAY_5        float64
PAY_6        float64
BILL_AMT1    float64
BILL_AMT2    float64
BILL_AMT3    float64
BILL_AMT4    float64
BILL_AMT5    float64
BILL_AMT6    float64
PAY_AMT1     float64
PAY_AMT2     float64
PAY_AMT3     float64
PAY_AMT4     float64
PAY_AMT5     float64
PAY_AMT6     float64
Y             object
dtype: object

now all types are correct!

### 3.2 Data Cleaning

First at all, let's take a look to the general situation.

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30201 entries, 1 to 30203
Data columns (total 25 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         30201 non-null  int64
 1   LIMIT_BAL  30201 non-null  float64
 2   SEX        30201 non-null  object
 3   EDU        30201 non-null  object
 4   MAR        30201 non-null  int64
 5   AGE        30201 non-null  int64
 6   PAY_0      30201 non-null  float64
 7   PAY_2      30201 non-null  float64
 8   PAY_3      30201 non-null  float64
 9   PAY_4      30201 non-null  float64
 10  PAY_5      30201 non-null  float64
 11  PAY_6      30201 non-null  float64
 12  BILL_AMT1  30201 non-null  float64
 13  BILL_AMT2  30201 non-null  float64
 14  BILL_AMT3  30201 non-null  float64
 15  BILL_AMT4  30201 non-null  float64
 16  BILL_AMT5  30201 non-null  float64
 17  BILL_AMT6  30201 non-null  float64
 18  PAY_AMT1   30201 non-null  float64
 19  PAY_AMT2   30201 non-null  float64
 20  PAY_AMT3   30201 non-null  float64
 21  PAY_AMT4   30201 non-null  float64
 22  PAY_AMT5   30201 non-null  float64
 23  PAY_AMT6   30201 non-null  float64
 24  Y          30201 non-null  object
dtypes: float64(19), int64(3), object(3)
memory usage: 6.0+ MB

no nulls values. Now, lest's drop the duplicated rows.

we had 201 duplicate lines, and no null values.

In [18]:
df = df.drop_duplicates()
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30000 entries, 1 to 30203
Data columns (total 25 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         30000 non-null  int64
 1   LIMIT_BAL  30000 non-null  float64
 2   SEX        30000 non-null  object
 3   EDU        30000 non-null  object
 4   MAR        30000 non-null  int64
 5   AGE        30000 non-null  int64
 6   PAY_0      30000 non-null  float64
 7   PAY_2      30000 non-null  float64
 8   PAY_3      30000 non-null  float64
 9   PAY_4      30000 non-null  float64
 10  PAY_5      30000 non-null  float64
 11  PAY_6      30000 non-null  float64
 12  BILL_AMT1  30000 non-null  float64
 13  BILL_AMT2  30000 non-null  float64
 14  BILL_AMT3  30000 non-null  float64
 15  BILL_AMT4  30000 non-null  float64
 16  BILL_AMT5  30000 non-null  float64
 17  BILL_AMT6  30000 non-null  float64
 18  PAY_AMT1   30000 non-null  float64
 19  PAY_AMT2   30000 non-null  float64
 20  PAY_AMT3   30000 non-null  float64
 21  PAY_AMT4   30000 non-null  float64
 22  PAY_AMT5   30000 non-null  float64
 23  PAY_AMT6   30000 non-null  float64
 24  Y          30000 non-null  object
dtypes: float64(19), int64(3), object(3)
memory usage: 6.0+ MB

### 3.3 Dealing with non-numerical data (One-Hot Encoding)

We can see we have three variables that are listed as being the object data type (SEX, EDU, Y); we need to covert these to 'Dummy variables' so they can be used in this multiple regression problem.

In [19]:
df.dtypes

ID             int64
LIMIT_BAL    float64
SEX           object
EDU           object
MAR            int64
AGE            int64
PAY_0        float64
PAY_2        float64
PAY_3        float64
PAY_4        float64
PAY_5        float64
PAY_6        float64
BILL_AMT1    float64
BILL_AMT2    float64
BILL_AMT3    float64
BILL_AMT4    float64
BILL_AMT5    float64
BILL_AMT6    float64
PAY_AMT1     float64
PAY_AMT2     float64
PAY_AMT3     float64
PAY_AMT4     float64
PAY_AMT5     float64
PAY_AMT6     float64
Y             object
dtype: object

Now we can use the **get_dummies()** function within pandas to convert our non-numeric columns to a series of binary numeric 'Dummy' columns as follows:

In [22]:
df = pd.get_dummies(df)
df.head()

,ID,LIMIT_BAL,MAR,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,...,PAY_AMT5,PAY_AMT6,SEX_female,SEX_male,EDU_graduate school,EDU_high school,EDU_other,EDU_university,Y_default,Y_not default
1,1,20000.0,1,24,2.0,2.0,-1.0,-1.0,-2.0,-2.0,...,0.0,0.0,1,0,0,0,0,1,1,0
2,2,120000.0,2,26,-1.0,2.0,0.0,0.0,0.0,2.0,...,0.0,2000.0,1,0,0,0,0,1,1,0
3,3,90000.0,2,34,0.0,0.0,0.0,0.0,0.0,0.0,...,1000.0,5000.0,1,0,0,0,0,1,0,1
4,4,50000.0,1,37,0.0,0.0,0.0,0.0,0.0,0.0,...,1069.0,1000.0,1,0,0,0,0,1,0,1
5,5,50000.0,1,57,-1.0,0.0,-1.0,0.0,0.0,0.0,...,689.0,679.0,0,1,0,0,0,1,0,1

In [24]:
df.dtypes

ID                       int64
LIMIT_BAL              float64
MAR                      int64
AGE                      int64
PAY_0                  float64
PAY_2                  float64
PAY_3                  float64
PAY_4                  float64
PAY_5                  float64
PAY_6                  float64
BILL_AMT1              float64
BILL_AMT2              float64
BILL_AMT3              float64
BILL_AMT4              float64
BILL_AMT5              float64
BILL_AMT6              float64
PAY_AMT1               float64
PAY_AMT2               float64
PAY_AMT3               float64
PAY_AMT4               float64
PAY_AMT5               float64
PAY_AMT6               float64
SEX_female               uint8
SEX_male                 uint8
EDU_graduate school      uint8
EDU_high school          uint8
EDU_other                uint8
EDU_university           uint8
Y_default                uint8
Y_not default            uint8
dtype: object